# Weights Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbSpline..::..Weights Property
NurbSpline Class See Also
---
Returns the weights of the nurb spline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DoubleArray Weights { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Weights As DoubleArray
	Get
```

Visual C++
---
```text
public:
property DoubleArray^ Weights {
	DoubleArray^ get ();
}
```

# See Also
NurbSpline Class
Autodesk.Revit.DB Namespace